MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx534f064l.h
extern volatile __C1FIFOCON6bits_t C1FIFOCON6bits __asm__ ("C1FIFOCON6") __attribute__((section("sfrs"), address(0xBF88B4D0)));
extern volatile uint32_t        C1FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF88B4D4)));
extern volatile uint32_t        C1FIFOCON6SET __attribute__((section("sfrs"),address(0xBF88B4D8)));
extern volatile uint32_t        C1FIFOCON6INV __attribute__((section("sfrs"),address(0xBF88B4DC)));
#define C1FIFOINT6 C1FIFOINT6
extern volatile uint32_t   C1FIFOINT6 __attribute__((section("sfrs"), address(0xBF88B4E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT6bits_t;
extern volatile __C1FIFOINT6bits_t C1FIFOINT6bits __asm__ ("C1FIFOINT6") __attribute__((section("sfrs"), address(0xBF88B4E0)));
extern volatile uint32_t        C1FIFOINT6CLR __attribute__((section("sfrs"),address(0xBF88B4E4)));
extern volatile uint32_t        C1FIFOINT6SET __attribute__((section("sfrs"),address(0xBF88B4E8)));
extern volatile uint32_t        C1FIFOINT6INV __attribute__((section("sfrs"),address(0xBF88B4EC)));
#define C1FIFOUA6 C1FIFOUA6
extern volatile uint32_t   C1FIFOUA6 __attribute__((section("sfrs"), address(0xBF88B4F0)));
extern volatile uint32_t        C1FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF88B4F4)));
extern volatile uint32_t        C1FIFOUA6SET __attribute__((section("sfrs"),address(0xBF88B4F8)));
extern volatile uint32_t        C1FIFOUA6INV __attribute__((section("sfrs"),address(0xBF88B4FC)));
#define C1FIFOCI6 C1FIFOCI6
extern volatile uint32_t   C1FIFOCI6 __attribute__((section("sfrs"), address(0xBF88B500)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI6bits_t;
extern volatile __C1FIFOCI6bits_t C1FIFOCI6bits __asm__ ("C1FIFOCI6") __attribute__((section("sfrs"), address(0xBF88B500)));
extern volatile uint32_t        C1FIFOCI6CLR __attribute__((section("sfrs"),address(0xBF88B504)));
extern volatile uint32_t        C1FIFOCI6SET __attribute__((section("sfrs"),address(0xBF88B508)));
extern volatile uint32_t        C1FIFOCI6INV __attribute__((section("sfrs"),address(0xBF88B50C)));
#define C1FIFOCON7 C1FIFOCON7
extern volatile uint32_t   C1FIFOCON7 __attribute__((section("sfrs"), address(0xBF88B510)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON7bits_t;
extern volatile __C1FIFOCON7bits_t C1FIFOCON7bits __asm__ ("C1FIFOCON7") __attribute__((section("sfrs"), address(0xBF88B510)));
extern volatile uint32_t        C1FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF88B514)));
extern volatile uint32_t        C1FIFOCON7SET __attribute__((section("sfrs"),address(0xBF88B518)));
extern volatile uint32_t        C1FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88B51C)));
#define C1FIFOINT7 C1FIFOINT7
extern volatile uint32_t   C1FIFOINT7 __attribute__((section("sfrs"), address(0xBF88B520)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT7bits_t;
extern volatile __C1FIFOINT7bits_t C1FIFOINT7bits __asm__ ("C1FIFOINT7") __attribute__((section("sfrs"), address(0xBF88B520)));
extern volatile uint32_t        C1FIFOINT7CLR __attribute__((section("sfrs"),address(0xBF88B524)));
extern volatile uint32_t        C1FIFOINT7SET __attribute__((section("sfrs"),address(0xBF88B528)));
extern volatile uint32_t        C1FIFOINT7INV __attribute__((section("sfrs"),address(0xBF88B52C)));
#define C1FIFOUA7 C1FIFOUA7
extern volatile uint32_t   C1FIFOUA7 __attribute__((section("sfrs"), address(0xBF88B530)));
extern volatile uint32_t        C1FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF88B534)));
extern volatile uint32_t        C1FIFOUA7SET __attribute__((section("sfrs"),address(0xBF88B538)));
extern volatile uint32_t        C1FIFOUA7INV __attribute__((section("sfrs"),address(0xBF88B53C)));
#define C1FIFOCI7 C1FIFOCI7
extern volatile uint32_t   C1FIFOCI7 __attribute__((section("sfrs"), address(0xBF88B540)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI7bits_t;
extern volatile __C1FIFOCI7bits_t C1FIFOCI7bits __asm__ ("C1FIFOCI7") __attribute__((section("sfrs"), address(0xBF88B540)));
extern volatile uint32_t        C1FIFOCI7CLR __attribute__((section("sfrs"),address(0xBF88B544)));
extern volatile uint32_t        C1FIFOCI7SET __attribute__((section("sfrs"),address(0xBF88B548)));
extern volatile uint32_t        C1FIFOCI7INV __attribute__((section("sfrs"),address(0xBF88B54C)));
#define C1FIFOCON8 C1FIFOCON8
extern volatile uint32_t   C1FIFOCON8 __attribute__((section("sfrs"), address(0xBF88B550)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON8bits_t;
extern volatile __C1FIFOCON8bits_t C1FIFOCON8bits __asm__ ("C1FIFOCON8") __attribute__((section("sfrs"), address(0xBF88B550)));
extern volatile uint32_t        C1FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF88B554)));
extern volatile uint32_t        C1FIFOCON8SET __attribute__((section("sfrs"),address(0xBF88B558)));
extern volatile uint32_t        C1FIFOCON8INV __attribute__((section("sfrs"),address(0xBF88B55C)));
#define C1FIFOINT8 C1FIFOINT8
extern volatile uint32_t   C1FIFOINT8 __attribute__((section("sfrs"), address(0xBF88B560)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT8bits_t;
extern volatile __C1FIFOINT8bits_t C1FIFOINT8bits __asm__ ("C1FIFOINT8") __attribute__((section("sfrs"), address(0xBF88B560)));
extern volatile uint32_t        C1FIFOINT8CLR __attribute__((section("sfrs"),address(0xBF88B564)));
extern volatile uint32_t        C1FIFOINT8SET __attribute__((section("sfrs"),address(0xBF88B568)));
extern volatile uint32_t        C1FIFOINT8INV __attribute__((section("sfrs"),address(0xBF88B56C)));
#define C1FIFOUA8 C1FIFOUA8
extern volatile uint32_t   C1FIFOUA8 __attribute__((section("sfrs"), address(0xBF88B570)));
extern volatile uint32_t        C1FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF88B574)));
extern volatile uint32_t        C1FIFOUA8SET __attribute__((section("sfrs"),address(0xBF88B578)));
extern volatile uint32_t        C1FIFOUA8INV __attribute__((section("sfrs"),address(0xBF88B57C)));
#define C1FIFOCI8 C1FIFOCI8
extern volatile uint32_t   C1FIFOCI8 __attribute__((section("sfrs"), address(0xBF88B580)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI8bits_t;
extern volatile __C1FIFOCI8bits_t C1FIFOCI8bits __asm__ ("C1FIFOCI8") __attribute__((section("sfrs"), address(0xBF88B580)));
extern volatile uint32_t        C1FIFOCI8CLR __attribute__((section("sfrs"),address(0xBF88B584)));
extern volatile uint32_t        C1FIFOCI8SET __attribute__((section("sfrs"),address(0xBF88B588)));
extern volatile uint32_t        C1FIFOCI8INV __attribute__((section("sfrs"),address(0xBF88B58C)));
#define C1FIFOCON9 C1FIFOCON9
extern volatile uint32_t   C1FIFOCON9 __attribute__((section("sfrs"), address(0xBF88B590)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON9bits_t;
extern volatile __C1FIFOCON9bits_t C1FIFOCON9bits __asm__ ("C1FIFOCON9") __attribute__((section("sfrs"), address(0xBF88B590)));
extern volatile uint32_t        C1FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF88B594)));
extern volatile uint32_t        C1FIFOCON9SET __attribute__((section("sfrs"),address(0xBF88B598)));
extern volatile uint32_t        C1FIFOCON9INV __attribute__((section("sfrs"),address(0xBF88B59C)));
#define C1FIFOINT9 C1FIFOINT9
extern volatile uint32_t   C1FIFOINT9 __attribute__((section("sfrs"), address(0xBF88B5A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT9bits_t;
extern volatile __C1FIFOINT9bits_t C1FIFOINT9bits __asm__ ("C1FIFOINT9") __attribute__((section("sfrs"), address(0xBF88B5A0)));
extern volatile uint32_t        C1FIFOINT9CLR __attribute__((section("sfrs"),address(0xBF88B5A4)));
extern volatile uint32_t        C1FIFOINT9SET __attribute__((section("sfrs"),address(0xBF88B5A8)));
extern volatile uint32_t        C1FIFOINT9INV __attribute__((section("sfrs"),address(0xBF88B5AC)));
#define C1FIFOUA9 C1FIFOUA9
extern volatile uint32_t   C1FIFOUA9 __attribute__((section("sfrs"), address(0xBF88B5B0)));
extern volatile uint32_t        C1FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF88B5B4)));
extern volatile uint32_t        C1FIFOUA9SET __attribute__((section("sfrs"),address(0xBF88B5B8)));
extern volatile uint32_t        C1FIFOUA9INV __attribute__((section("sfrs"),address(0xBF88B5BC)));
#define C1FIFOCI9 C1FIFOCI9
extern volatile uint32_t   C1FIFOCI9 __attribute__((section("sfrs"), address(0xBF88B5C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI9bits_t;
